---
kind: property
id: P:Autodesk.Revit.DB.Blend.TopOffset
source: html/6290d412-737a-1ba4-c9ca-28fe050dbecd.htm
---
# Autodesk.Revit.DB.Blend.TopOffset Property

The offset of the top end of the blend relative to the sketch plane.

## Syntax (C#)
```csharp
public double TopOffset { get; set; }
```